Repository: msmagnanijr/edc-dotnet-csharp
Catalog: fundamentos-csharp/TP04/solution/Infrastructure/Resources/Language.*.resx
Languages: pt

# addBoxOffice
source: Enter the total box office:
pt: Digite a bilheteria total do filme:

# addMovieLabel
source: Add a New Movie
pt: Adicionar um Novo Filme

# addMovieName
source: Enter the name of the movie that you want to add:
pt: Digite o nome do filme que você deseja adicionar:

# addReleaseDate
source: Enter the movie release date:
pt: Digite a data de lançamento do filme:

# addStudioName
source: Enter the name of the film studio that produced the movie:
pt: Digite o nome do estúdio de cinema responsável pela produção do filme:

# addSuccessMessage
source: Successful registration!
pt: Cadastro realizado com sucesso!

# askForConfirmation
source: Is the following information correct? Type | 1 | for Yes or | 2 | for No:
pt: Os dados abaixo estão corretos? Digite | 1 | para Sim ou | 2 | para Não:

# backMainMenu
source: Backing to the main menu...
pt: Voltando ao meuno principal...

# boxOfficeLabel
source: Box Office:
pt: Bilheteria:

# chooseMovie
source: Select one of the options below to view the desired movie data:
pt: Selecione uma das opções abaixo para visualizar os dados do filme desejado:

# chooseMovieRemove
source: Select one of the options below to remove:
pt: Selecione uma das seguintes opções para remover:

# databaseChoice
source: Please configure the application database. Choose | 1 | for List , | 2 | for LinkedList or | 3 | for File ( WIP ).
pt: Por favor configure o banco de dados da aplicação. Escolha | 1 | para List, | 2 | para LinkedList ou | 3 | para File ( WIP ).

# databaseNotSupported
source: is not a valid or supported database!
pt: não é um banco de dados válido ou suportado!

# deleteMovieLabel
source: Remove a Movie
pt: Remover um Filme

# errorMessage
source: An unexpected error occurred:
pt: Um erro inesperado ocorreu:

# exitMovieLabel
source: Exit
pt: Sair

# findAllMovieLabel
source: List All Movies
pt: Listar todos os Filmes

# findMovieDetailsLabel
source: List Details about a Movie
pt: Listar detalhes de um Filme

# languageChoice
source: Application set up for English!
pt: Aplicação configurada para Português!

# languageChoiceMessage
source: Please configure the application language. Choose | PT | for Portuguese or | EN | for English.
pt: Por favor configure o idioma da aplicação. Escolha | PT | para Português ou | EN | para Inglês.

# languageNotSupported
source: is not a valid or supported language!
pt: não é um idioma válido ou suportado!

# messageFile
source: The application has been set up to use the File type as a database.
pt: A aplicação foi configurada para usar o tipo File como banco de dados.

# messageLinkedList
source: The application has been set up to use the LinkedList type as a database.
pt: A aplicação foi configurada para usar o tipo LinkedList como banco de dados.

# messageList
source: The application has been set up to use the List type as a database.
pt: A aplicação foi configurada para usar o tipo List como banco de dados.

# moreMovieInfo
source: to get more information about the movie
pt: para receber mais informações sobre o filme

source: Movie Details
pt: Detalhes do Filme

# movieListLabel
source: Movies List
pt: Lista de Filmes

# movieToFind
source: Enter the name, or part of the name of the movie you want to find:
pt: Digite o nome, ou parte do nome do filme que deseja encontrar:

# movieToRemove
source: Enter the name, or part of the name of the movie you want to remove:
pt: Digite o nome, ou parte do nome do filme que deseja remover:

# nameLabel
source: Name:
pt: Nome:

# releaseDateLabel
source: Release Date:
pt: Data de lançamento:

# removeMovieMessage
source: to remove the movie
pt: para remover o filme

# selectIdMovie
source: Select the Id
pt: Selecione o Id

# studioLabel
source: Film Studio:
pt: Estúdio reponsável:

# textMovieDetailsBoxOffice
source: The total Box Office was
pt: A Bilheteria total foi de

# textMovieDetailsFilmeStudio
source: The Film Studio
pt: O Estúdio

# textMovieDetailsRelease
source: was released in
pt: foi lançado em

# textMovieDetailsReleaseCalc
source: The movie was released
pt: O filme foi lançado a

# textMovieDetailsReleaseDays
source: days ago or
pt: dias atrás ou

# textMovieDetailsReleaseYears
source: years
pt: anos

# textMovieDetailsReponsable
source: was responsible for the production of the movie
pt: foi reponsável pela produção do filme

# whatToDo
source: What do you want to do?
pt: O que você deseja fazer?

# yesLabel
source: Yes
pt: Sim
